===
Method.  Empty, no arguments, no return identifiers.
===
method A () {}
---
(source_file
    (method
      (identifier)
      (args)
      (body)))
===
Method.  More than one argument, no return identifiers.
===
method A (a: Int, b: Int) {}
---
(source_file
    (method
      (identifier)
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (body)))
===
Method.  More than one argument, more than one return identifiers.
===
method A (a: Int, b: Int) returns (c: Int, d: Int) {}
---
(source_file
    (method
      (identifier)
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (body)))
===
Method.  Simple specification
===
method A (a: Int, b: Int) returns (c: Int, d: Int)
  requires a <= b
{

}
---
(source_file
    (method
      (identifier)
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (specification
        (expression))
      (body)))
===
Method.  Simple assignment.
===
method A (a: Int, b: Int) returns (c: Int, d: Int)
  requires a <= b
{
  c := a;
}
---
(source_file
    (method
      (identifier)
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (specification
        (expression))
      (body
        (instruction
          (assignment
            (identifier)
            (expression))))))
===
Method.  Multiple parallel assignment.
===
method A (a: Int, b: Int) returns (c: Int, d: Int)
  requires a <= b
{
  c, d := a, b;
}
---
(source_file
    (method
      (identifier)
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (args
          (identifier)
          (type)
          (identifier)
          (type))
      (specification
        (expression))
      (body
        (instruction
          (assignment
            (identifier)
            (identifier)
            (expression)
            (expression))))))
===
Method.  Assignment with method call as source.
===
method A () {
  a := m ();
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (assignment
            (identifier)
            (expression
              (identifier)
              (args)))))))
===
Method.  identifier declaration and assignment.
===
method A () {
  var a := b;
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (variable_declaration
            (assignment
              (identifier)
              (expression)))))))
===
Method.  Empty if instruction.
===
method A () {
  if a <= b {
  } else {
  }
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (instruction_conditional
            (expression)
            (body)
            (body))))))
===
Method.  Match conditional.
===
method A() {
  match a {
    case j => { b := j; }
    case k => { b := k; }
  }
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (instruction_conditional
            (body
              (instruction
                (assignment
                  (identifier)
                  (expression))))
            (body
              (instruction
                (assignment
                  (identifier)
                  (expression)))))))))
===
Method.  While loop
===
method A() {
  while a < b {}
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (instruction_loop
            (expression)
            (body))))))
===
Method.  Assert statement
===
method A() {
  assert a < b;
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (instruction_spec
            (expression))))))
===
Method.  Assume statement
===
method A() {
  assume a < b;
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (instruction_spec
            (expression))))))
===
Method.  yield statement.
===
method A() {
  yield a, b;
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (yield
            (expression)
            (expression))))))
===
Method.  Return statement.
===
method A() {
  return a, b;
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (return
            (expression)
            (expression))))))
===
Method.  Forall such as specification.
===
method A()
  forall a | i < j {}
{}
---
(source_file
    (method
      (identifier)
      (args)
      (specification
        (forall_spec
          (expression)
          (body)))
      (body)))
===
Method.  Forall in specification.
===
method A()
  forall e <- s {}
{}
---
(source_file
    (method
      (identifier)
      (args)
      (specification
        (forall_spec
          (body)))
      (body)))
===
Method.  Label without parentheses.
===
method A()
{
  label L:
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (label
            (identifier))))))
===
Method.  Label parenthesised.
===
method A()
{
  label L: {}
}
---
(source_file
    (method
      (identifier)
      (args)
      (body
        (instruction
          (label
            (identifier)
            (body))))))

